function generateAdder(a: number): (b: number) => number {
  return function (b: number) {
    return a + b;
  };
}

const addTwo = generateAdder(2);

console.log(addTwo(3));

console.log(addTwo(5));

/* 
টাইপ ডেক্লারেশন বাদ দিয়ে নরমাল জাভাস্ক্রিপ্টে আগে চিন্তা করে দেখুন।
generateAdder ফাংশন টা একটা higher order function যখন এটা প্রথম বার কল করা হয় তখন সেইটা a প্যারামিটার টা পায়। এবং যেহেতু ঐ ফাংশনটা থেকে আর কিছু করা হচ্ছে না তাই তার কাজ শেষ হয়ে যায় এবং a প্যারামিটার টা Closure এর কারণে ঐ ফাংশনে scope এ থেকে যায়।
যেহেতু জাভাস্ক্রিপ্টে ফাংশন কে first-class citizen হিসাবে ধরা হয় তাই আপনি চাইলে এটাকে যেকোনো ভ্যারিয়েবেলেও স্টোর করতে পারেন।
পরর্বতীতে যখন আপনি generateAdder ফাংশন কে একটি argument দিয়ে কল করেন এবং সেটি একটি ভ্যারিয়েবলে স্টোর করেন তখন ঐ ভ্যারিয়েবল টা একটা ফাংশন হয়ে যায়, যেই ফাংশন টা আসলে generateAdder return করে। নতুন ভ্যারিয়েবলে রাখা ফাংশন টাও প্রথম ফাংশন টির মত একটি প্যারামিটার নেয় এবং রিটান করে পূর্বের সংখ্যা ও বর্তমান সংখ্যার যোগফল। */
